import java.util.ListResourceBundle;

public class Language_ru extends ListResourceBundle {
    @Override
    public Object[][] getContents ( ) {
        return contents;
    }

    private Object[][] contents = {
            {"add", "добавить маршрут"},
            {"sum_of_distance", "Cумма расстояний маршрутов"},
            {"history", "История"},
            {"info", "Информация"},
            {"execute_script", "Выполнить скрипт"},
            {"clear", "Очистить коллекцию"},
            {"filter_less_than_distance", "Показать маршруты, расстояние которых меньше"},
            {"print_ascending", "Показать коллекцию в порядке возрастания"},
            {"remove_lower", "Удалить маршруты, которые больше заданного"},
            {"remove_greater", "Удалить маршруты, которые меньше заданного"},
            {"blup", "Можете пожамкать и снять стресс"},
            {"add1", "Добавить маршрут"},
            {"sum_of_distance1", "Сумма расстояния маршрутов"},
            {"history1", "История"},
            {"info1", "Информация"},
            {"execute_script1", "Выполнить скрипт"},
            {"clear1", "Очистить коллекцию"},
            {"filter_less_than_distance1", "Показать маршруты, расстояние которых меньше"},
            {"print_ascending1", "Показать коллекцию в порядке возрастания"},
            {"remove_lower1", "Удалить маршруты, котрые больше заданного"},
            {"remove_greater1", "Удалить маршруты, которые меньше заданного"},
            {"blup1", "Можете пожамкать и снять стресс"},
            {"user", "Пользователь:"},
            {"user1", "Пользователь:"},
            {"language", "Выберите язык"},
            {"language1", "Выберите язык"},
            {"graphics", "Графика"},
            {"collection", "Коллекция"},
            {"owner", "Владелец"},
            {"id", "id"},
            {"name", "Название маршрута"},
            {"coordinateX", "Текущий X"},
            {"coordinateY", "Текущий Y"},
            {"creationDate", "Дата создания"},
            {"fromName", "Название отправления"},
            {"fromX", "Отправление X"},
            {"fromY", "Отправление Y"},
            {"toName", "Название прибытия"},
            {"toX", "Прибытие X"},
            {"toY", "Прибытие Y"},
            {"distance", "Расстояние"},
            {"connect", "Установка соединения..."},
            {"enterAddress", "Введите адрес"},
            {"enterPort", "Введите порт"},
            {"Ууууу, в адресе не должно быть пробелов", "Ууууу, в адресе не должно быть пробелов"},
            {"Порт с пробелами, серьезно? Зачем?", "Порт с пробелами, серьезно? Зачем?"},
            {"Такого адреса, к сожалению, не существует", "Такого адреса, к сожалению, не существует"},
            {"Порт должен быть циферкой", "Порт должен быть циферкой"},
            {"Соединение установлено", "Соединение установлено"},
            {"buttonConnect", "Подключиться"},
            {"inLK", "Вход в учетную запись"},
            {"user", "Логин"},
            {"pass", "Пароль"},
            {"signUp", "Зарегистрироваться"},
            {"signIn", "Войти"},
            {"Пользователь с таким логином уже зарегистрирован. Может, вам стоит авторизоваться?", "Пользователь с таким логином уже зарегистрирован. Может, вам стоит авторизоваться?"},
            {"Вы успешно зарегистрировались", "Вы успешно зарегистрировались"},
            {"Пользователь с таким логином не зарегистрирован", "Пользователь с таким логином не зарегистрирован"},
            {"Вы успешно авторизовались", "Вы успешно авторизовались"},
            {"Вы ввели неправильный пароль", "Вы ввели неправильный пароль"},
            {"Вам следует использовать только латиницу( Вините helios, не меня", "Вам следует использовать только латиницу( Вините helios, не меня"}

    };

}
